eecs600.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-01-12 Tue 22:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>EECS 600 (Internet Security) Notes</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Stephen Brennan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">EECS 600 (Internet Security) Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline6">1. 2016-01-12 Tuesday</a>
<ul>
<li><a href="#orgheadline1">1.1. Logistics</a></li>
<li><a href="#orgheadline5">1.2. Encryption and Authentication</a>
<ul>
<li><a href="#orgheadline2">1.2.1. Symmetric encryption:</a></li>
<li><a href="#orgheadline3">1.2.2. Asymmetric encryption</a></li>
<li><a href="#orgheadline4">1.2.3. Uses of Encryption</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">1</span> 2016-01-12 Tuesday</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Logistics</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Goals:
</p>
<ul class="org-ul">
<li>Many subfields of networking are fleeting, but a few like Security and
Measurements are long-term.  So the topic of Security is a prudent one to
study.</li>
<li>We will prepare for research in this area by reading papers, presenting
them, and undertaking a research project.</li>
<li>This is not computer security:
<ul class="org-ul">
<li>We will not study buffer overflows, Sql injection, etc.  Nothing that
allows someone to take over a computer.</li>
<li>Instead, we will cover attacks that don't require compromising the
computer, just the network.</li>
</ul></li>
</ul>

<p>
I'm sure topics will be available online, and we'll get to them soon enough.
</p>

<p>
Tasks:
</p>
<ul class="org-ul">
<li>Read papers, write summaries (which "isn't as easy as you think").</li>
<li>Present a paper and lead the discussion on it.</li>
<li>Final exam = project + presentation</li>
</ul>

<p>
Paper Summaries:
</p>
<ul class="org-ul">
<li>Topic
<ul class="org-ul">
<li>1-2 sentence summary of the topic.</li>
<li>Is it a "mechanisms" or "characterizations" paper?
<ul class="org-ul">
<li>Mechanisms: proposes some new technique</li>
<li>Characterizations: measures some property of the internet</li>
<li>Sometimes it's both</li>
</ul></li>
</ul></li>
<li>Key Ideas/Observations
<ul class="org-ul">
<li>1-2 most important ideas</li>
<li>For mechanisms, the ideas behind the mechanisms</li>
<li>For characterizations, the key observations.</li>
</ul></li>
<li>Flaws (1 or 2)</li>
<li>Open Questions (1 or 2)
<ul class="org-ul">
<li>Where can you take the research from here?</li>
</ul></li>
<li>My Impressions
<ul class="org-ul">
<li>1-2 sentences with your impression (is it good or not, why?)</li>
</ul></li>
</ul>

<p>
Your summaries must follow these sections exactly.  Some may be absent, but
everything must have a section.  Due before class so we can discuss (submitted
online via email in plain text).  Note that this is mostly a summary!  Your
opinions on the paper only belong in the small "My Impressions" section.
</p>

<p>
Some questions to ask about the paper, to identify flaws.
</p>

<ul class="org-ul">
<li>Can someone else replicate the results using the paper?</li>
<li>Are the assumptions clear enough?  (Careful, we're not assessing, just
learning).  Do the assumptions potentially bias the paper?</li>
<li>Does the research eliminate alternative explanations of results?</li>
<li>Do conclusions follow logically from evidence.</li>
</ul>

<p>
Dos and don'ts in paper summaries:
</p>

<ul class="org-ul">
<li>Not a review.</li>
<li>Inappropriate characterizations are "comprehensive", or "insufficient
references".</li>
<li>This is what you need to remember 10 years from now.</li>
<li>Value conciseness.</li>
<li>Value specificity: focus on "how", not "what"</li>
</ul>

<p>
Discussion guidelines:
</p>

<ul class="org-ul">
<li>Lecture for about 30-40 minutes.
<ul class="org-ul">
<li>Allocate 2 minutes per slide.  You expect they will be quicker, but
usually your explanations.</li>
</ul></li>
<li>Discussion for 30-40 minutes</li>
<li>Wrap up (5 mins)</li>
</ul>

<p>
Grading:
</p>
<ul class="org-ul">
<li>20% paper presentation.</li>
<li>40% paper summaries</li>
<li>10% class participation (attendance + discussions)</li>
<li>30% final</li>
</ul>

<p>
Office hours 2:40-3:40 Thursday, or by appointment.  Prefix email subject
lines with "eecs600".
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.2</span> Encryption and Authentication</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This content will be a brief overview of the basics.  Just enough for our
subsequent discussions on security.
</p>

<p>
Two varieties of encryption: symmetric and asymmetric
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.2.1</span> Symmetric encryption:</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Two parties share a secret.</li>
<li>Encryption/decryption algorithms scramble/unscramble plaintext using the
key.</li>
<li>Typically very fast, and the key is very small.</li>
<li>However, it is very difficult to distribute keys securely.</li>
</ul>

<p>
Diffie-Hellman's protocol:
</p>

<ol class="org-ol">
<li>Alice and Bob agree to use a prime number p and a base g (which have some
properties we won't discuss).</li>
<li>Alice chooses secret integer a, then sends Bob \(A = g^a \mod p\).  It
turns out that it's very difficult to guess a from A.</li>
<li>Bob chooses secret integer b, then sends Alice \(B = g^b \mod p\).</li>
<li>Alice computes \(s = B^a \mod p = g^{ba} \mod p\)</li>
<li>Bob computes \(s = A^b \mod p = g^{ab} \mod p\).</li>
<li>Alice and Bob now share the secret \(s\).</li>
</ol>

<p>
Invented in 1976!!
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.2.2</span> Asymmetric encryption</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Pair of keys, (S,P).  You encrypt with one and decrypt with the other.</li>
<li>With asymmetric encryption, the key exchange is very similar.  We make one
of our keys public, and we simply encrypt messages to others using their
public keys.</li>
</ul>

<p>
Two types of asymmetric key types:
</p>
<ul class="org-ul">
<li>RSA
<ul class="org-ul">
<li>Large (1-4 kbits)</li>
<li>Efficient</li>
</ul></li>
<li>Elliptic curve
<ul class="org-ul">
<li>Small (about 160 bits)</li>
<li>Expensive</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.2.3</span> Uses of Encryption</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>Message Encryption - make it so that only owners of a key can read it.</li>
<li>Message Signature
<ul class="org-ul">
<li>Message may be distributed in the clear.</li>
<li>Only the key owner could have signed it.</li>
<li>Verifies authenticity and that the message has not been modified.</li>
</ul></li>
</ul>

<p>
Authentication (signing) using symmetric keys.
</p>

<ol class="org-ol">
<li>Append the key to the message.</li>
<li>Hash that to get a "message authentication code", and append that to your
original message, and send it.</li>
<li>Recipient can duplicate your actions and verify the message.</li>
</ol>

<p>
Message Authentication using asymmetric keys
</p>

<ol class="org-ol">
<li>Hash the message, and encrypt it with your private key.  Include that as
the signature.</li>
<li>Recipient can decrypt your signature using the public key, hash the
message, and compare the two hashes.</li>
</ol>

<p>
Interesting side note: the signature will necessarily be the same size as
the asymmetric key, which is inconvenient for large keys.
</p>

<p>
Sadly, with asymmetric keys, it's difficult to be certain that a key belongs
to somebody (and isn't being spoofed).  So you need to get keys certified by
a trusted third party.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Stephen Brennan</p>
<p class="date">Created: 2016-01-12 Tue 22:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
